package com.hillel.reziapov.homeworks.homework3;

public class Main {
    public static void main(String[] args) {

        /*
        Встановити Git
        Ініціалізувати репозиторій у папці з будь-яким файлом
        Створити віддалений репозиторій та прив'язати його до локального. Назва репозиторію - "Ваше прізвище+курс+дата створення". Робіть його публічним
        Запушити репозиторій у хмару
        Внести зміни до локального репозиторії
        Запушити зміни на хмару
         */

    }
}
